<?php

// 1. Создайте переменную с названием b содержащую boolean значение "ложь"
$b = false;

// 2. Создайте переменную с названием isLessonCompleted. И поместите в эту переменную значение "истина"
$isLessonCompleted = true;

// 3. Создайте переменные с названием number1 и number2. И поместите в них различные целые числа (значения придумайте)
$number1 = 5;
$number2 = 3;

// 4. Выведите сумму чисел 3 и 4, вместе с типом получившегося значения
var_dump(3 + 4);

// 5. Создайте переменную x, и поместите в него число с плавающей точкой 7.3
$x = 7.3;

// 6. Создайте переменную result, и поместите результат сложения переменных x и number1 и выведите его вместе с типом
$result = $x + $number1;
var_dump($result);

// 7. Создайте переменные line1, line2, line3 и поместите в них три разные строки.
$line1 = 'test';
$line2 = 'string';
$line3 = 'world';

// 8. Создайте переменную line представляющую собой конкатенацию этих трех переменных в указанном порядке line1, line3, line2
$line = $line1 . $line2 . $line3;
var_dump($line);


